# SplitRegion Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CompoundStructure..::..SplitRegion Method
CompoundStructure Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SplitRegion(UV, RectangularGridSegmentOrientation) | Splits the region which contains the specified grid point by a line with the specified direction. |
| SplitRegion(UV, RectangularGridSegmentOrientation, Int32%) | Splits the region which contains the specified grid point by a line with the specified direction. |

# See Also
CompoundStructure Class
CompoundStructure Members
Autodesk.Revit.DB Namespace